{
  "raidVictorySlides": [
    {
      "image": "/assets/locations/salty_mug_rented_room.png",
      "text": "The battle is won! Finn lies defeated, his reign of terror ended. Rodrick claps you on the shoulder. 'Not bad, kid. Not bad at all.'"
    },
    {
      "image": "/assets/events/raid_victory_barracks.png",
      "text": "Back at the barracks, Matthias offers you a seat. 'You've got the makings of a Tidehunter,' he says. 'We could use someone like you. Think about it.'"
    },
    {
      "image": "/assets/events/demo_end_screen.png",
      "text": "This marks the end of the Divine Fantasy Classic Demo. Thank you for playing! Keep an eye out for future updates."
    }
  ],
  "lukePrologueSlides": [
    {
      "image": "https://i.imgur.com/tYATeUX.jpeg",
      "text": "The story of Luke begins, as many in the Whispers do, with the sea's cruel embrace. His mother, Elara, succumbed to childbirth's fevered grip, and his father, a fisherman named Gareth, was claimed by a sudden squall that showed no mercy. Orphaned before he could even speak his name, he was brought to Leo's Lighthouse, a beacon of hope standing defiant against the salt-sprayed cliffs of Driftwatch. Here, under the watchful eye of the kindly Old Leo, his life truly began."
    },
    {
      "image": "https://i.imgur.com/Hy0z6aZ.jpeg",
      "text": "In the orphanage's quiet halls, he forged a family not of blood, but of bond. There was Sarah, whose sweet nature made her the steadfast 'mother' of their small group; Robert, the strong, serious boy who dreamed of a life beyond the docks; and young Kyle, whose mischievous grin was a constant source of trouble and laughter. Surrounded by his only friends, Luke's tragic past became a foundation, not an anchor. His sharp mind, a gift from a life of observation, became his tool—a beacon of potential promising a future far grander than his humble beginnings."
    }
  ],
  "wakeupEventSlides": [
    {
      "image": "/assets/locations/salty_mug_rented_room.png",
      "text": "You wake in a cramped room at the Salty Mug. Old Man Finn bangs on the door: ‘Two months without rent, kid. Out.’ The lesson ends. The day begins."
    },
    {
      "image": "/assets/locations/driftwatch_slums_day.png",
      "text": "Kicked to the streets, you step into Driftwatch’s slums. The real world doesn’t wait—and neither should you."
    }
  ],
  "finnDebtIntroSlides": [
    {
      "image": "/assets/locations/salty_mug_rented_room.png",
      "text": "You wake to Old Man Finn staring down, a guard idling beside him—knife glinting."
    }
  ],
  "breakfastEventSlides": [
    {
      "image": "/assets/events/luke_breakfast.png",
      "text": "You share a simple breakfast at Leo’s Lighthouse—warm bread, salted fish, and a quiet moment before the day."
    }
  ],
  "playEventSlidesSarah": [
    {
      "image": "/assets/events/luke_play_together.png",
      "text": "You spend time with Sarah, helping tidy the common room and laughing at quiet memories. Her calm steadies you more than you'd admit."
    }
  ],
  "playEventSlidesRobert": [
    {
      "image": "/assets/events/luke_play_together.png",
      "text": "You trade jabs with Robert and talk dreams bigger than the docks. Work hard, aim higher, and don't let the wind decide your path."
    }
  ],
  "playEventSlidesKyle": [
    {
      "image": "/assets/events/luke_play_together.png",
      "text": "You chase Kyle through the lighthouse halls, laughing as he slips past your reach. Mischief fades, leaving the night a little lighter."
    }
  ],
  "playEventSlidesAlone": [
    {
      "image": "/assets/events/luke_play_alone.png",
      "text": "You spend a quiet hour by yourself. The lighthouse hums with distant voices, but your thoughts are your own—clear, steady, and sharp."
    }
  ],
  "smugglerTrapSlides": [
    {
      "image": "/assets/locations/leo_lighthouse_room.png",
      "text": "A frantic knock jolts you awake. Kyle whispers through the door: ‘Luke, get up—Robert’s slipped out. Something’s wrong.’"
    },
    {
      "image": "/assets/locations/driftwatch_docks_night.png",
      "text": "You and Kyle hurry to the docks. Lanterns sway in the wind; shadows move between stacked crates."
    },
    {
      "image": "/assets/locations/driftwatch_docks_night.png",
      "text": "Down by the water, Robert meets figures in the dark. You stay low—watching, listening—ready to act."
    }
  ],
  "robertCaughtSlides": [
    {
      "image": "/assets/events/robert_caught.png",
      "text": "The smugglers overwhelm Robert, blades flashing in the dark. He takes blow after blow, but refuses to fall. With a desperate shout, he throws himself at the attackers. 'Run! Get Kyle out of here!' he screams, sacrificing himself. You grab Kyle and sprint into the night, the sounds of the struggle fading behind you."
    },
    {
      "image": "/assets/locations/leo_lighthouse_room.png",
      "text": "Back in the safety of the lighthouse, you and Kyle collapse, gasping for air. The silence is heavy, broken only by Kyle's quiet sobs. Robert is gone."
    }
  ],
  "gameOverSlides": [
    {
      "image": "/assets/events/game_over.png",
      "text": "Luke has fallen in battle. His journey ends here."
    }
  ],
  "raid_salty_mug_intro": [
    {
      "image": "/assets/events/raid_gear_handoff.png",
      "text": "You gather with Rodrick, Matthias, and Stan at the Tidehunter Quarter. 'Suit up, kid,' Rodrick grunts, tossing you a bundle of iron gear. 'You'll need this where we're going.' You equip the heavy iron armor and grip the sword, feeling the weight of the coming battle."
    },
    {
      "image": "/assets/events/raid_siege_salty_mug.png",
      "text": "The four of you approach the Salty Mug under the cover of darkness. The tavern's lights spill out onto the street, but inside, trouble is brewing. Matthias signals the advance. It's time to end this."
    },
    {
      "image": "/assets/events/raid_confront_finn.png",
      "text": "You burst through the doors! Finn stands up, knocking over his chair. 'You?! And the Guard?!' He sneers, snapping his fingers. Three thugs step out from the shadows. 'Kill them all!'"
    }
  ],
  "rebelRaidIntroSlides": [
    {
      "image": "/assets/events/raid_gear_handoff.png",
      "text": "You gather with Rodrick, Matthias, and Stan at the Tidehunter Quarter. 'Suit up, kid,' Rodrick grunts, tossing you a bundle of iron gear. 'You'll need this where we're going.' You equip the heavy iron armor and grip the sword, feeling the weight of the coming battle."
    },
    {
      "image": "/assets/events/raid_siege_salty_mug.png",
      "text": "The squad moves in on the Salty Mug. Customers scatter as you siege the tavern, clearing the main floor. The path to Finn is open."
    },
    {
      "image": "/assets/events/raid_confront_finn.png",
      "text": "You corner Finn in the back room! He sneers, snapping his fingers. 'You?! And the Guard?! Kill them all!' Three thugs step out from the shadows."
    }
  ],
  "rebelVictorySlides": [
    {
      "image": "/assets/locations/salty_mug_night.png",
      "text": "Finn falls, his reign over the slums ended. Rodrick nods at you. 'You've got guts, kid. Maybe the Guard could use someone like you.' The Shadow Hand retreats... for now."
    }
  ],
  "elaraDeliverySlides": [
    {
      "image": "/assets/events/elara_delivery.png",
      "text": "You navigate the twisting alleys of the slums until you find the recipient—a twitchy man in the shadows. He grabs the package, checks the contents, and nods. The 'medicine' has been delivered."
    }
  ],
  "berylDeliverySlides": [
    {
      "image": "/assets/events/beryl_delivery.png",
      "text": "You wait at the servant's entrance of a grand estate until a noblewoman arrives. She takes the parcel with a cool glance and signs the receipt with a practiced hand. The delivery is complete."
    }
  ],
  "benCheatEventSlides": [
    {
      "image": "/assets/events/ben_cheat.png",
      "text": "The cards fly. Ben sweats. You signal from the side—a cough, a tap. He catches on. Slowly, the pile of silvers in front of him grows. He cashes out before they catch on."
    }
  ],
  "sellLocketSlides": [
    {
      "image": "/assets/locations/driftwatch_noble_quarter_day.png",
      "text": "You present the antique locket to the noble collector. His eyes widen as he inspects the craftsmanship. 'Remarkable,' he murmurs. 'A rare find indeed.'"
    },
    {
      "image": "/assets/locations/driftwatch_noble_quarter_day.png",
      "text": "Without hesitation, he counts out ten silver coins and places them in your hand. 'A fair price for such history,' he says, pocketing the locket. The debt payment is secured."
    }
  ],
  "evilEndingSlides": [
    {
      "image": "/assets/locations/driftwatch_slums_night.png",
      "text": "You take the key and head deep into the slums, finding the hidden grate Finn mentioned. The air is thick with rot as you descend into the darkness."
    },
    {
      "image": "/assets/items/vanessa_charm.png",
      "text": "Deep in the tunnels, you find a strange, sealed door. The charm pulses with a faint light. You place it in the recess, and the stone grinds open..."
    },
    {
      "image": "/assets/events/demo_end_screen.png",
      "text": "This marks the end of the Divine Fantasy Classic Demo!"
    }
  ],
  "hybridEndingSlides": [
    {
      "image": "/assets/locations/salty_mug_slums_outside.png",
      "text": "You step out of the Salty Mug with thirty silvers lighter in your pouch and Finn's words heavier in your head. You were hard when you had to be, soft when you chose to be, and Driftwatch is still standing either way."
    },
    {
      "image": "/assets/locations/driftwatch_slums_day.png",
      "text": "The slums swallow you back up. Debtors, guards, smugglers, saints in rags – none of them know what kind of man you are yet. Maybe you don't either. But for now, you're alive, and the city is wide open."
    },
    {
      "image": "/assets/events/demo_end_screen.png",
      "text": "This marks the end of the Divine Fantasy Classic Demo. Thank you for playing!"
    }
  ]
}
